/*
 * Copyright 2017, Data61, CSIRO (ABN 41 687 119 230)
 * Copyright 2020, HENSOLDT Cyber GmbH
 *
 * SPDX-License-Identifier: BSD-2-Clause
 */
#include <platsupport/i2c.h>

#include "../../arch/arm/clock.h"
#include "../../services.h"
#include <assert.h>
#include <string.h>
#include <utils/util.h>

#define CCM_PADDR        0x020C4000
#define CCM_SIZE             0x1000

#define CCM_ANALOG_PADDR 0x020C8000
#define CCM_ANALOG_SIZE      0x1000

/* common flags for all PLLs */
#define PLL_LOCK                BIT(31)
#define PLL_BYPASS              BIT(16)
#define PLL_GET_BYPASS_SRC(x)   (((x) >> 14) & 0x3)
#define PLL_ENABLE              BIT(13)
#define PLL_PWR_DOWN            BIT(12)

/* PLL_ARM (PLL1), up to 1.3 GHz */
#define PLL_ARM_DIV_MASK        0x7F
#define PLL_ARM_GET_DIV(x)      ((x) & PLL_ARM_DIV_MASK)

/* PLL_SYS (also called PLL2 or PLL_528) runs at a fixed multiplier 22 based
 * on the 24 MHz oscillator to create a 528 MHz a reference clock
 * (24 MHz * 22 = 528 MHz). Other values than 22 are not supposed to be used.
 */
#define PLL_SYS_DIV_MASK        BIT(0)
#define PLL_SYS_GET_DIV(x)      ((x) & PLL_SYS_DIV_MASK)

/* PLL_SYS spread spectrum control (CCM_ANALOG_PLL_SYS_SS) */
#define PLL_SYS_SS_STOP(x)      (((x) & 0xffff) << 16)
#define PLL_SYS_SS_EN           BIT(15)
#define PLL_SYS_SS_STEP(x)      ((x) & 0x7fff)

/* PLL_ENET (PLL6), disabled on reset, runs at a fixed multiplier 20+(5/6)
 * which based on the 24 MHz oscillator as reference clock gives a 500 MHz clock
 * (24 MHz * (20+(5/6)) = 500 MHz). This use used to generate the frequencies
 * 125 MHz (for PCIe and gigabit ethernet), 100 MHz (for SATA) and 50 or 25 MHz
 * for the external ethernet interface.
 */
#define PLL_ENET_ENABLE_100M    BIT(20)
#define PLL_ENET_ENABLE_125M    BIT(19)
#define PLL_ENET_DIV_MASK       0x3
#define PLL_ENET_GET_DIV(x)     ((x) & PLL_ENET_DIV_MASK)

/* PLL_USB. There is PLL3 (USB1_PLL or 480 PLL) that runs at a fixed multiplier
 * 20 and based on the 24 MHz oscillator creates a 480 MHz reference clock
 * (24 MHz * 20 = 480 MHz). It is used for USB0 PHY (OTG PHY) and also to create
 * clocks for UART, CAN, other serial interfaces and audio interfaces.
 * There is also 480_PLL2 (USB2_PLL), which provides clock exclusively to
 * USB2 PHY (also known as HOST PHY) that also runs at a fixed multiplier of 20
 * to generate a 480 MHz clock.
 */
#define PLL_USB_ENABLE_CLKS     BIT(6)
#define PLL_USB_DIV_MASK        0x3
#define PLL_USB_GET_DIV(x)      ((x) & PLL_USB_DIV_MASK)

/* clock gating in CCM_CCGRn */
#define CLKGATE_MODE_OFF        0x0
#define CLKGATE_MODE_ON_RUN     0x1
#define CLKGATE_MODE_RESERVED   0x2
#define CLKGATE_MODE_ON_ALL     0x3
#define CLKGATE_MODE_MASK       0x3

/* CCM Clock Output Source (CCM_CCOSR) */
#define CLKO1_SRC_AHB       0xBU
#define CLKO1_SRC_IPG       0xCU
#define CLKO1_SRC_MASK      0xFU /* bit 0-3 */
#define CLKO1_ENABLE        BIT(7)
#define CLKO_SEL            BIT(8) /* select CCM_CLKO1 or CCM_CLKO2 */
#define CLKO2_SRC_MASK      (0x1FU << 16) /* bit 16-20 */
#define CLKO2_SRC_MMDC_CH0  (0U << 16) /* b00000 for mmdc_ch0_clk_root */
#define CLKO2_ENABLE        BIT(24)

typedef volatile struct {
    uint32_t ccr;      /* 0x000 */
    uint32_t ccdr;     /* 0x004 */
    uint32_t csr;      /* 0x008 */
    uint32_t ccsr;     /* 0x00C */
    uint32_t cacrr;    /* 0x010 */
    uint32_t cbcdr;    /* 0x014 */
    uint32_t cbcmr;    /* 0x018 */
    uint32_t cscmr1;   /* 0x01C */
    uint32_t cscmr2;   /* 0x020 */
    uint32_t cscdr1;   /* 0x024 */
    uint32_t cs1cdr;   /* 0x028 */
    uint32_t cs2cdr;   /* 0x02C */
    uint32_t cdcdr;    /* 0x030 */
    uint32_t chsccdr;  /* 0x034 */
    uint32_t cscdr2;   /* 0x038 */
    uint32_t cscdr3;   /* 0x03C */
    uint32_t res0[2];
    uint32_t cdhipr;   /* 0x048 */
    uint32_t res1[1];
    uint32_t ctor;     /* 0x050 */
    uint32_t clpcr;    /* 0x054 */
    uint32_t cisr;     /* 0x058 */
    uint32_t cimr;     /* 0x05C */
    uint32_t ccosr;    /* 0x060 */
    uint32_t cgpr;     /* 0x064 */
    uint32_t ccgr[7];  /* 0x068 */
    uint32_t res2[1];
    uint32_t cmeor;    /* 0x088 */
} ccm_regs_t;

typedef volatile struct {
    uint32_t val;                    /* 0x00 */
    uint32_t set;                    /* 0x04 */
    uint32_t clr;                    /* 0x08 */
    uint32_t tog;                    /* 0x0C */
} alg_sct_t;

typedef volatile struct {
    alg_sct_t vbus_detect;           /* 0x00 */
    alg_sct_t chrg_detect;           /* 0x10 */
    uint32_t vbus_detect_stat;       /* 0x20 */
    uint32_t res0[3];
    uint32_t chrg_detect_stat;       /* 0x30 */
    uint32_t res1[3];
    uint32_t res2[4];
    alg_sct_t misc;                  /* +0x50 */
} ccm_alg_usbphy_regs_t;

typedef volatile struct {
    /* PLL_ARM */
    alg_sct_t pll_arm;               /* 0x000 */
    /* PLL_USB * 2 */
    alg_sct_t pll_usb[2];            /* 0x010 */
    /* PLL_SYS */
    alg_sct_t pll_sys;               /* 0x030 */
    uint32_t  pll_sys_ss;            /* 0x040 */
    uint32_t  res0[3];
    uint32_t  pll_sys_num;           /* 0x050 */
    uint32_t  res1[3];
    uint32_t  pll_sys_denom;         /* 0x060 */
    uint32_t  res2[3];
    /* PLL_AUDIO */
    alg_sct_t pll_audio;             /* 0x070 */
    uint32_t  pll_audio_num;         /* 0x080 */
    uint32_t  res3[3];
    uint32_t  pll_audio_denom;       /* 0x090 */
    uint32_t  res4[3];
    /* PLL_VIDIO */
    alg_sct_t pll_video;             /* 0x0A0 */
    uint32_t  pll_video_num;         /* 0x0B0 */
    uint32_t  res5[3];
    uint32_t  pll_video_denom;       /* 0x0C0 */
    uint32_t  res6[3];
    /* PLL_MLB */
    alg_sct_t pll_mlb;               /* 0x0D0 */
    /* PLL_ENET */
    alg_sct_t pll_enet;              /* 0x0E0 */
    /* PDF_480 */
    alg_sct_t pfd_480;               /* 0x0F0 */
    /* PDF_528 */
    alg_sct_t pfd_528;               /* 0x100 */
    uint32_t  res7[16];
    /* MISC0 */
    alg_sct_t misc0;                 /* 0x150 */
    uint32_t  res8[4];
    /* MISC2 */
    alg_sct_t misc2;                 /* 0x170 */
    uint32_t  res9[8];
    /* USB phy control is implemented here for the sake of componentisation
     * since it shares the same register space.
     */
    ccm_alg_usbphy_regs_t phy[2];    /* 0x1a0, 0x200 */
    uint32_t digprog;                /* 0x260 */
} ccm_alg_regs_t;

static struct {
    ccm_regs_t     *ccm;
    ccm_alg_regs_t *alg;
} clk_regs = { .ccm = NULL, .alg = NULL};

static struct clock master_clk = { CLK_OPS_DEFAULT(MASTER) };

static int change_pll(alg_sct_t *pll, uint32_t div_mask, uint32_t div)
{
    /* div must be within the mask */
    if (0 != (div & (~div_mask))) {
        ZF_LOGE("invaid PLL setting, mask=0x%x, div=0x%x", div_mask, div);
        assert(0);
        return -1;
    }

    /* bypass on during clock manipulation */
    pll->set = PLL_BYPASS;
    /* power down the PLL */
    pll->set = PLL_PWR_DOWN;
    /* set the divisor */
    pll->clr = div_mask;
    pll->set = div;
    /* power up the PLL */
    pll->clr = PLL_PWR_DOWN;

    /* Wait for the PLL to stabilize. */
    for (unsigned int loop_cnt = 0; /* nothing */ ; loop_cnt++) {
        if (pll->val & PLL_LOCK) {
            ZF_LOGD("got PLL_LOCK after %u loops", loop_cnt);
            break;
        }

