/*
 * Copyright 2017, Data61
 * Commonwealth Scientific and Industrial Research Organisation (CSIRO)
 * ABN 41 687 119 230.
 *
 * This software may be distributed and modified according to the terms of
 * the BSD 2-Clause license. Note that NO WARRANTY is provided.
 * See "LICENSE_BSD2.txt" for details.
 *
 * @TAG(DATA61_BSD)
 */
#include "src.h"
#include "../../arch/arm/clock.h"
#include "../../services.h"
#include <assert.h>
#include <string.h>
#include <utils/util.h>

/****************
 ****  PLLs  ****
 ****************/

/* PLL Control (<pll>_PLL_CTRL) Register */
#define PLL_CTRL_RESET                  BIT(0)
#define PLL_CTRL_PWRDWN                 BIT(1)
#define PLL_CTRL_BYPASS_QUAL            BIT(3)
#define PLL_CTRL_BYPASS_FORCE           BIT(4)

#define PLL_CTRL_FDIV_SHIFT             12
#define PLL_CTRL_FDIV(x)                ((x) * BIT(PLL_CTRL_FDIV_SHIFT))
#define PLL_CTRL_FDIV_MASK              PLL_CTRL_FDIV(0x7F)
#define PLL_CTRL_FDIV_MIN               13
#define PLL_CTRL_FDIV_MAX               66

/* PLL Status Register */
#define PLL_STATUS_ARM_PLL_LOCK         BIT(0)
#define PLL_STATUS_DDR_PLL_LOCK         BIT(1)
#define PLL_STATUS_IO_PLL_LOCK          BIT(2)
#define PLL_STATUS_ARM_PLL_STABLE       BIT(3)
#define PLL_STATUS_DDR_PLL_STABLE       BIT(4)
#define PLL_STATUS_IO_PLL_STABLE        BIT(5)

/* PLL Configuration (<pll>_PLL_CFG) Register */
#define PLL_CFG(pll_cp, pll_res, lock_cnt)  \
    (((lock_cnt) << 12) | (pll_cp << 8) | (pll_res << 4))

/* Required PLL Frequency Configuration Settings */
#define PLL_CFG_FDIV13      PLL_CFG(2,  6, 750)
#define PLL_CFG_FDIV14      PLL_CFG(2,  6, 700)
#define PLL_CFG_FDIV15      PLL_CFG(2,  6, 650)
#define PLL_CFG_FDIV16      PLL_CFG(2, 10, 625)
#define PLL_CFG_FDIV17      PLL_CFG(2, 10, 575)
#define PLL_CFG_FDIV18      PLL_CFG(2, 10, 550)
#define PLL_CFG_FDIV19      PLL_CFG(2, 10, 525)
#define PLL_CFG_FDIV20      PLL_CFG(2, 12, 500)
#define PLL_CFG_FDIV21      PLL_CFG(2, 12, 475)
#define PLL_CFG_FDIV22      PLL_CFG(2, 12, 450)
#define PLL_CFG_FDIV23      PLL_CFG(2, 12, 425)
#define PLL_CFG_FDIV24      PLL_CFG(2, 12, 400)
#define PLL_CFG_FDIV25      PLL_CFG(2, 12, 400)
#define PLL_CFG_FDIV26      PLL_CFG(2, 12, 375)
#define PLL_CFG_FDIV27      PLL_CFG(2, 12, 350)
#define PLL_CFG_FDIV28      PLL_CFG(2, 12, 350)
#define PLL_CFG_FDIV29      PLL_CFG(2, 12, 325)
#define PLL_CFG_FDIV30      PLL_CFG(2, 12, 325)
#define PLL_CFG_FDIV31      PLL_CFG(2,  2, 300)
#define PLL_CFG_FDIV32      PLL_CFG(2,  2, 300)
#define PLL_CFG_FDIV33      PLL_CFG(2,  2, 300)
#define PLL_CFG_FDIV34      PLL_CFG(2,  2, 275)
#define PLL_CFG_FDIV35      PLL_CFG(2,  2, 275)
#define PLL_CFG_FDIV36      PLL_CFG(2,  2, 275)
#define PLL_CFG_FDIV37      PLL_CFG(2,  2, 250)
#define PLL_CFG_FDIV38      PLL_CFG(2,  2, 250)
#define PLL_CFG_FDIV39      PLL_CFG(2,  2, 250)
#define PLL_CFG_FDIV40      PLL_CFG(2,  2, 250)
#define PLL_CFG_FDIV41      PLL_CFG(3, 12, 250)
#define PLL_CFG_FDIV42      PLL_CFG(3, 12, 250)
#define PLL_CFG_FDIV43      PLL_CFG(3, 12, 250)
#define PLL_CFG_FDIV44      PLL_CFG(3, 12, 250)
#define PLL_CFG_FDIV45      PLL_CFG(3, 12, 250)
#define PLL_CFG_FDIV46      PLL_CFG(3, 12, 250)
#define PLL_CFG_FDIV47      PLL_CFG(3, 12, 250)
#define PLL_CFG_FDIV48      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV49      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV50      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV51      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV52      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV53      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV54      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV55      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV56      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV57      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV58      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV59      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV60      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV61      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV62      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV63      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV64      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV65      PLL_CFG(2,  4, 250)
#define PLL_CFG_FDIV66      PLL_CFG(2,  4, 250)

struct pll_cfg_t {
    uint8_t fdiv;
    uint32_t pll_cfg;
};

static struct pll_cfg_t pll_cfg_tbl[] = {
    /* Need to offset by PLL_CTRL_FDIV_MIN when accessing a row in the table */
    {13, PLL_CFG_FDIV13},
    {14, PLL_CFG_FDIV14},
    {15, PLL_CFG_FDIV15},
    {16, PLL_CFG_FDIV16},
    {17, PLL_CFG_FDIV17},
    {18, PLL_CFG_FDIV18},
    {19, PLL_CFG_FDIV19},
    {20, PLL_CFG_FDIV20},
    {21, PLL_CFG_FDIV21},
    {22, PLL_CFG_FDIV22},
    {23, PLL_CFG_FDIV23},
    {24, PLL_CFG_FDIV24},
    {25, PLL_CFG_FDIV25},
    {26, PLL_CFG_FDIV26},
    {27, PLL_CFG_FDIV27},
    {28, PLL_CFG_FDIV28},
    {29, PLL_CFG_FDIV29},
    {30, PLL_CFG_FDIV30},
    {31, PLL_CFG_FDIV31},
    {32, PLL_CFG_FDIV32},
    {33, PLL_CFG_FDIV33},
    {34, PLL_CFG_FDIV34},
    {35, PLL_CFG_FDIV35},
    {36, PLL_CFG_FDIV36},
    {37, PLL_CFG_FDIV37},
    {38, PLL_CFG_FDIV38},
    {39, PLL_CFG_FDIV39},
    {40, PLL_CFG_FDIV40},
    {41, PLL_CFG_FDIV41},
    {42, PLL_CFG_FDIV42},
    {43, PLL_CFG_FDIV43},
    {44, PLL_CFG_FDIV44},
    {45, PLL_CFG_FDIV45},
    {46, PLL_CFG_FDIV46},
    {47, PLL_CFG_FDIV47},
    {48, PLL_CFG_FDIV48},
    {49, PLL_CFG_FDIV49},
    {50, PLL_CFG_FDIV50},
    {51, PLL_CFG_FDIV51},
    {52, PLL_CFG_FDIV52},
    {53, PLL_CFG_FDIV53},
    {54, PLL_CFG_FDIV54},
    {55, PLL_CFG_FDIV55},
    {56, PLL_CFG_FDIV56},
    {57, PLL_CFG_FDIV57},
    {58, PLL_CFG_FDIV58},
    {59, PLL_CFG_FDIV59},
    {60, PLL_CFG_FDIV60},
    {61, PLL_CFG_FDIV61},
    {62, PLL_CFG_FDIV62},
    {63, PLL_CFG_FDIV63},
    {64, PLL_CFG_FDIV64},
    {65, PLL_CFG_FDIV65},
    {66, PLL_CFG_FDIV66}
};

/******************
 ****  Clocks  ****
 ******************/

/* Clock Source */
#define CLK_SRC_IO_PLL      0x01
#define CLK_SRC_ARM_PLL     0x02
#define CLK_SRC_DDR_PLL     0x03

#define CLK_SRCSEL(x)       ((x) << 4)
#define CLK_GET_SRCSEL(x)   (((x) >> 4) & 0x3)

/* Each clock uses a 6-bit divisor */
#define CLK_DIVISOR_MIN     1
#define CLK_DIVISOR_MAX     0x3F

/*
 * The clock divider is located at bits 8:13. Some clock generators have two
 * cascated dividers, with the second divider located at bits 20:25.
 */
#define CLK_DIVISOR0_SHIFT                  8
#define CLK_DIVISOR1_SHIFT                  20

#define CLK_DIVISOR(div, x)                 ((x) * BIT(CLK_DIVISOR##div##_SHIFT))
#define CLK_DIVISOR_MASK(div)               CLK_DIVISOR(div, CLK_DIVISOR_MAX)
#define CLK_SET_DIVISOR(div, reg, val)      \
    do {                                    \
        uint32_t v;                         \
        v = reg & ~(CLK_DIVISOR_MASK(div)); \
        reg = v | CLK_DIVISOR(div, val);    \
    } while (0)
#define CLK_GET_DIVISOR(div, reg)           \
    ((reg & CLK_DIVISOR_MASK(div)) >> CLK_DIVISOR##div##_SHIFT)

/* Clock Control (enable/disable a clock) */
#define CLK_CLKACT          BIT(0)

/**********************
 ****  CPU Clocks  ****
 **********************/

/* CPU Clock Control */
#define CPU_CLK_CTRL_CPU_6OR4XCLKACT        BIT(24)
#define CPU_CLK_CTRL_CPU_3OR2XCLKACT        BIT(25)
#define CPU_CLK_CTRL_CPU_2XCLKACT           BIT(26)
#define CPU_CLK_CTRL_CPU_1XCLKACT           BIT(27)
#define CPU_PERI_CLKACT                     BIT(28)

/* CPU Clock Ratio Mode Select */
#define CPU_CLK_621_TRUE                    BIT(0)

/**********************
 ****  DDR Clocks  ****
 **********************/

/* DDR Clock Control */
#define DDR_CLK_CTRL_DDR_3XCLKACT   BIT(0)
#define DDR_CLK_CTRL_DDR_2XCLKACT   BIT(1)

/* DDR Clock Divisors */
#define DDR_3XCLK_DIVISOR_SHIFT     20
#define DDR_2XCLK_DIVISOR_SHIFT     26
#define DDR_CLK_DIVISOR(dom, x)     ((x) * BIT(DDR_##dom##XCLK_DIVISOR_SHIFT))
#define DDR_CLK_DIVISOR_MASK(dom)   DDR_CLK_DIVISOR(dom, CLK_DIVISOR_MAX)
#define DDR_CLK_SET_DIVISOR(dom, val)                            \
    do {                                                         \
        clk_regs->ddr_clk_ctrl &= ~(DDR_CLK_DIVISOR_MASK(dom));  \
        clk_regs->ddr_clk_ctrl |= DDR_CLK_DIVISOR(dom, val);     \
    } while (0)
#define DDR_CLK_GET_DIVISOR(dom)    \
    ((clk_regs->ddr_clk_ctrl & DDR_CLK_DIVISOR_MASK(dom)) >> DDR_##dom##XCLK_DIVISOR_SHIFT)

/**************************
 ****  FPGA PL Clocks  ****
 **************************/

/* Programmable Logic (PL) - i.e. FPGA - clock registers */
typedef volatile struct {
    uint32_t clk_ctrl;  /* PL Clock x Output Control */
    uint32_t thr_ctrl;  /* PL Clock x Throttle Control */
    uint32_t thr_cnt;   /* PL Clock x Throttle Count */
    uint32_t thr_sta;   /* PL Clock x Throttle Status */
} pl_clk_regs_t;

/***************************
 ****  Clock Registers  ****
 ***************************/

struct zynq7000_clk_regs {
    /* We are only interested in the clock registers in SLCR */
    uint32_t arm_pll_ctrl;      /* 0x100 ARM PLL Control */
    uint32_t ddr_pll_ctrl;      /* 0x104 DDR PLL Control */
    uint32_t io_pll_ctrl;       /* 0x108 IO PLL Control */
    uint32_t pll_status;        /* 0x10C PLL Status */

    uint32_t arm_pll_cfg;       /* 0x110 ARM PLL Configuration */
    uint32_t ddr_pll_cfg;       /* 0x114 DDR PLL Configuration */
    uint32_t io_pll_cfg;        /* 0x118 IO PLL Configuration */
    uint32_t res0[1];
    uint32_t arm_clk_ctrl;      /* 0x120 CPU Clock Control */
    uint32_t ddr_clk_ctrl;      /* 0x124 DDR Clock Control */
    uint32_t dci_clk_ctrl;      /* 0x128 DCI Clock Control */

    uint32_t aper_clk_ctrl;     /* 0x12C AMBDA Peripheral Clock Control */
    uint32_t usb0_clk_ctrl;     /* 0x130 USB 0 ULPI Clock Control */
    uint32_t usb1_clk_ctrl;     /* 0x134 USB 1 ULPI Clock Control */
    uint32_t gem0_rclk_ctrl;    /* 0x138 GigE 0 Rx Clock and Rx Signals Select */
    uint32_t gem1_rclk_ctrl;    /* 0x13C GigE 1 Rx Clock and Rx Signals Select */
    uint32_t gem0_clk_ctrl;     /* 0x140 GigE 0 Ref Clock Control */
    uint32_t gem1_clk_ctrl;     /* 0x144 GigE 1 Ref Clock Control */
    uint32_t smc_clk_ctrl;      /* 0x148 SMC Ref Clock Control */
    uint32_t lqspi_clk_ctrl;    /* 0x14C QUAD SPI REf Clock Control */
    uint32_t sdio_clk_ctrl;     /* 0x150 SDIO Ref Clock Control */
    uint32_t uart_clk_ctrl;     /* 0x154 UART Ref Clock Control */
    uint32_t spi_clk_ctrl;      /* 0x158 SPI Ref Clock Control */
    uint32_t can_clk_ctrl;      /* 0x15C CAN Ref Clock Control */
    uint32_t can_mioclk_ctrl;   /* 0x160 CAN MIO Clock Control */
    uint32_t dbg_clk_ctrl;      /* 0x164 SoC Debug Clock Control */
    uint32_t pcap_clk_ctrl;     /* 0x168 PCAP Clock Control */
    uint32_t topsw_clk_ctrl;    /* 0x16C Central Interconnect Clock Control */
    pl_clk_regs_t fpga_clk[4];  /* 0x170 PL Clock 0 */
    uint32_t pad1[5];
    uint32_t clk_621_true;      /* 0x1C4 CPU Clock Ratio Mode Select */
    uint32_t pad2[79];
    uint32_t wdt_clk_sel;       /* 0x304 SWDT Clock Source Select */
};

static const enum clk_id cpu_clk_src[] = {
                                             CLK_ARM_PLL,
                                             CLK_ARM_PLL,
                                             CLK_DDR_PLL,
                                             CLK_IO_PLL
                                         };

static const enum clk_id generic_clk_src[] = {
                                                 CLK_IO_PLL,
                                                 CLK_IO_PLL,
                                                 CLK_ARM_PLL,
                                                 CLK_DDR_PLL
                                             };

#define fpga_clk_src generic_clk_src
#define can_clk_src generic_clk_src
#define pcap_clk_src generic_clk_src

static volatile struct zynq7000_clk_regs* clk_regs = NULL;

/* Set divisors, avoiding over clocking peripherals */
static inline void
